{
    "pdf_info": [
        {
            "para_blocks": [
                {
                    "type": "image",
                    "bbox": [
                        79,
                        39,
                        155,
                        58
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                79,
                                39,
                                155,
                                58
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        79,
                                        39,
                                        155,
                                        58
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                79,
                                                39,
                                                155,
                                                58
                                            ],
                                            "type": "image",
                                            "image_path": "65b46bf4ea8b3dd46a1f048323269f912eafd584e7d08c8bef942a567772b1c4.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 0,
                            "type": "image_body"
                        }
                    ],
                    "index": 0
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 0
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        21,
                        14,
                        74,
                        24
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                21,
                                14,
                                74,
                                24
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        21,
                                        14,
                                        74,
                                        24
                                    ],
                                    "type": "text",
                                    "content": "2025/8/4 21:20"
                                }
                            ]
                        }
                    ],
                    "index": 0
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 1
        },
        {
            "para_blocks": [
                {
                    "type": "image",
                    "bbox": [
                        235,
                        198,
                        359,
                        322
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                235,
                                198,
                                359,
                                322
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        235,
                                        198,
                                        359,
                                        322
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                235,
                                                198,
                                                359,
                                                322
                                            ],
                                            "type": "image",
                                            "image_path": "669a18639066c111f29348254c68e8f24afa535cf0ae720c7227672248954766.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 0,
                            "type": "image_body"
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        133,
                        370,
                        462,
                        394
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                133,
                                370,
                                462,
                                394
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        133,
                                        370,
                                        462,
                                        394
                                    ],
                                    "type": "text",
                                    "content": "Sonic: Where Builders Come First"
                                }
                            ]
                        }
                    ],
                    "index": 1,
                    "level": 1
                },
                {
                    "bbox": [
                        205,
                        401,
                        390,
                        434
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                205,
                                401,
                                390,
                                434
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        205,
                                        401,
                                        390,
                                        434
                                    ],
                                    "type": "text",
                                    "content": "Unlocking Next- Gen Blockchain  Speed, Security, and Use Cases"
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        257,
                        449,
                        337,
                        478
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                257,
                                449,
                                337,
                                478
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        257,
                                        449,
                                        337,
                                        478
                                    ],
                                    "type": "text",
                                    "content": "By Sonic Labs  October 14, 2024"
                                }
                            ]
                        }
                    ],
                    "index": 3
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 2
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        252,
                        99,
                        342,
                        118
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                252,
                                99,
                                342,
                                118
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        252,
                                        99,
                                        342,
                                        118
                                    ],
                                    "type": "text",
                                    "content": "Disclaimer"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        134,
                        528,
                        232
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                134,
                                528,
                                232
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        134,
                                        528,
                                        232
                                    ],
                                    "type": "text",
                                    "content": "S token holders are responsible for the custody and security of their own tokens, including management of private keys and wallet access credentials. Sonic Labs does not provide custodial services and disclaims responsibility for any loss or theft of S tokens resulting from user error, unauthorized access, or failure to maintain secure storage. The S token does not represent any claim on Sonic Labs' assets, profits, or revenues, nor does it confer ownership, dividend rights, or profit participation in Sonic Labs or any affiliated entity. The holding or use of S tokens does not create a debtor- creditor or similar relationship between Sonic Labs and the holder."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        248,
                        528,
                        331
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                248,
                                528,
                                331
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        248,
                                        528,
                                        331
                                    ],
                                    "type": "text",
                                    "content": "S tokens will be made available to the public through a combination of mechanisms including airdrops, exchange listings, DeFi and other distribution programs. The price of S tokens will be determined by market forces, except where tokens are distributed at no charge (e.g. through airdrop campaigns). Proceeds from any token sales or related activities will be used to fund the development of the Sonic blockchain, support ecosystem initiatives, grow the developer community, and cover operational and compliance costs."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        347,
                        528,
                        487
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                347,
                                528,
                                487
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        347,
                                        528,
                                        487
                                    ],
                                    "type": "text",
                                    "content": "The purchase, holding, and use of S tokens involves significant risk. These risks include, but are not imited to: volatility in the price of S tokens, regulatory uncertainty regarding the legal treatment of the S token in various jurisdictions, technological risks such as potential flaws, vulnerabilities, or failures in the Sonic blockchain's code or infrastructure, loss of access to tokens due to user error (e.g. loss of private keys), and market risks including low liquidity or demand for S tokens. Prospective holders should carefully assess these risks and seek independent professional advice as appropriate before acquiring S tokens. Token holders and/or users who wish to raise concerns or file complaints related to the S token or the Sonic blockchain may contact Sonic Labs at support@soniclabs.com. Complaints will be handled in accordance with Sonic Labs's internal procedures, with the aim of providing a response within 30 days of receipt."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        67,
                        503,
                        528,
                        616
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                503,
                                528,
                                616
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        503,
                                        528,
                                        616
                                    ],
                                    "type": "text",
                                    "content": "Sonic Operations Ltd. (\"Sonic Labs\") is the entity facilitating the issuance of the S token and supporting the development of the Sonic blockchain. The Sonic network is decentralized, secured by a globally distributed set of independent validators, with no single operator controlling network consensus or block production. Sonic Labs is incorporated as an Exempted Company under the laws of the Cayman Islands with its registered office at c/o Stuarts Corporate Services Ltd., P.O. Box 2510, Kensington House, 69 Dr. Roy's Drive, Grand Cayman, KY1- 1104, Cayman Islands. Sonic Labs contributes to network development, ecosystem growth, and compliance support. Additional information is available at https://www.soniclabs.com/ and inquiries may be directed to legal@soniclabs.com."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        631,
                        528,
                        715
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                631,
                                528,
                                715
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        631,
                                        528,
                                        715
                                    ],
                                    "type": "text",
                                    "content": "This crypto- asset paper has not been approved by any competent authority in any Member State of the European Union. The S token does not benefit from the protection of deposit guarantee schemes or investor compensation schemes in the European Union. You should be aware that you might lose all the money invested. This white paper serves to provide comprehensive information for prospective holders and for the purpose of admission to trading within the European Union, but does not constitute a public offer (sale) of S tokens by Sonic Operations Ltd. at a fixed offer price or subscription period."
                                }
                            ]
                        }
                    ],
                    "index": 5
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 3
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        223,
                        99,
                        371,
                        118
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                223,
                                99,
                                371,
                                118
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        223,
                                        99,
                                        371,
                                        118
                                    ],
                                    "type": "text",
                                    "content": "Table of Contents"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        66,
                        183,
                        528,
                        196
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                183,
                                528,
                                196
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        183,
                                        528,
                                        196
                                    ],
                                    "type": "text",
                                    "content": "Abstract."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        66,
                        217,
                        528,
                        232
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                217,
                                528,
                                232
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        217,
                                        528,
                                        232
                                    ],
                                    "type": "text",
                                    "content": "Introduction."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        66,
                        253,
                        528,
                        269
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                253,
                                528,
                                269
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        253,
                                        528,
                                        269
                                    ],
                                    "type": "text",
                                    "content": "Business Case & Initial Objectives."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        66,
                        289,
                        528,
                        303
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                289,
                                528,
                                303
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        289,
                                        528,
                                        303
                                    ],
                                    "type": "text",
                                    "content": "Incentives."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        83,
                        307,
                        528,
                        375
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                83,
                                307,
                                528,
                                375
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        83,
                                        307,
                                        528,
                                        375
                                    ],
                                    "type": "text",
                                    "content": "Sonic Labs Innovator Fund. 7  Airdrop Program. 7  Fee Monetization. 10  Sonic Liquid Staking Tokens (LSTs). 10"
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        66,
                        396,
                        528,
                        411
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                396,
                                528,
                                411
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        396,
                                        528,
                                        411
                                    ],
                                    "type": "text",
                                    "content": "Technology."
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        83,
                        414,
                        528,
                        464
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                83,
                                414,
                                528,
                                464
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        83,
                                        414,
                                        528,
                                        464
                                    ],
                                    "type": "text",
                                    "content": "Sonic Gateway. 11  Sonic Database. 13  Sonic Virtual Machine. 13"
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        66,
                        484,
                        528,
                        498
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                484,
                                528,
                                498
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        484,
                                        528,
                                        498
                                    ],
                                    "type": "text",
                                    "content": "Tokenomics."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        83,
                        502,
                        528,
                        571
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                83,
                                502,
                                528,
                                571
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        83,
                                        502,
                                        528,
                                        571
                                    ],
                                    "type": "text",
                                    "content": "Airdrop Program. 14  Ongoing Funding. 14  Block Rewards. 15  Token Burn. 16"
                                }
                            ]
                        }
                    ],
                    "index": 9
                },
                {
                    "bbox": [
                        65,
                        590,
                        528,
                        606
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                65,
                                590,
                                528,
                                606
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        65,
                                        590,
                                        528,
                                        606
                                    ],
                                    "type": "text",
                                    "content": "Conclusion."
                                }
                            ]
                        }
                    ],
                    "index": 10
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 4
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        260,
                        99,
                        333,
                        118
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                260,
                                99,
                                333,
                                118
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        260,
                                        99,
                                        333,
                                        118
                                    ],
                                    "type": "text",
                                    "content": "Abstract"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        135,
                        528,
                        227
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                135,
                                528,
                                227
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        135,
                                        528,
                                        227
                                    ],
                                    "type": "text",
                                    "content": "In an evolving blockchain landscape, what truly sets one network apart from countless others that fade away? For Sonic, we believe the key lies in offering unique products and features that empower developers to build applications more competitively than on any other chain. Our focus is on providing tangible value to developers by increasing their earnings, granting them control over network fee pricing, and streamlining user payment options, all with sub- second finality."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        240,
                        528,
                        347
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                240,
                                528,
                                347
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        240,
                                        528,
                                        347
                                    ],
                                    "type": "text",
                                    "content": "However, many existing platforms have not adequately addressed these developer- centric needs. Ethereum, focusing on scalability through optimistic and zero- knowledge rollups, now has over USD 34 billion<sup>1</sup> locked in its layer- 2 (L2) networks. This shift towards L2 solutions has inadvertently emphasized extracting value through centralized sequencer fees rather than fostering high- quality application development. Incentive structures designed to drive higher valuations and fees through roll- up deployments have commoditized L2s, prioritizing sequencer revenue over security and decentralization."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        361,
                        527,
                        406
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                361,
                                527,
                                406
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        361,
                                        527,
                                        406
                                    ],
                                    "type": "text",
                                    "content": "This trend has created an imbalance: sequencers benefit disproportionately while developers remain undercompensated. Consequently, the adoption of innovative consumer apps has stalled, limiting their potential for significant market impact."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        67,
                        419,
                        528,
                        496
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                419,
                                528,
                                496
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        419,
                                        528,
                                        496
                                    ],
                                    "type": "text",
                                    "content": "Recognizing these challenges, we introduce Sonic - a layer- 1 (L1) blockchain platform that redefines the developer incentive model. Sonic's Fee Monetization program allows developers to earn up to "
                                },
                                {
                                    "bbox": [
                                        67,
                                        419,
                                        528,
                                        496
                                    ],
                                    "type": "inline_equation",
                                    "content": "90\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        419,
                                        528,
                                        496
                                    ],
                                    "type": "text",
                                    "content": " of the fees generated by their applications. With features like dynamic fees, fee subsidization, and native account abstraction, Sonic provides flexible tools to enhance user experience and foster adoption."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        509,
                        528,
                        586
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                509,
                                528,
                                586
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        509,
                                        528,
                                        586
                                    ],
                                    "type": "text",
                                    "content": "As legacy L1 chains face a critical juncture - evolve or risk irrelevance - Sonic leads the transformation by delivering unprecedented scalability, decentralization, and near- instant speed. Combining the strengths of L1 and L2 models, Sonic offers 400,000 transactions per second, sub- second finality, and a native, secure bridge to Ethereum and beyond for enhanced liquidity and security."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        599,
                        527,
                        644
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                599,
                                527,
                                644
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        599,
                                        527,
                                        644
                                    ],
                                    "type": "text",
                                    "content": "By integrating cutting- edge technology with a revolutionary developer- centric model, Sonic aims to redefine the blockchain landscape, reinvigorating focus on productive consumer- facing applications and empowering builders to create profitable on- chain businesses."
                                }
                            ]
                        }
                    ],
                    "index": 6
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 5
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        245,
                        99,
                        348,
                        118
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                245,
                                99,
                                348,
                                118
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        245,
                                        99,
                                        348,
                                        118
                                    ],
                                    "type": "text",
                                    "content": "Introduction"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        135,
                        528,
                        179
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                135,
                                528,
                                179
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        135,
                                        528,
                                        179
                                    ],
                                    "type": "text",
                                    "content": "This whitepaper introduces Sonic, our L1 network that provides the fastest settlement layer for digital assets with 400,000 transactions per second for native token transfers at sub- second finality, while connecting to Ethereum's liquidity through the Sonic Gateway."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        193,
                        526,
                        253
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                193,
                                526,
                                253
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        193,
                                        526,
                                        253
                                    ],
                                    "type": "text",
                                    "content": "Alongside this technological leap, we are revolutionizing application incentive structures, making Sonic the only L1 where developers truly come first, earning up to "
                                },
                                {
                                    "bbox": [
                                        67,
                                        193,
                                        526,
                                        253
                                    ],
                                    "type": "inline_equation",
                                    "content": "90\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        193,
                                        526,
                                        253
                                    ],
                                    "type": "text",
                                    "content": " of all fees their apps generate through our unique Fee Monetization program. Additionally, we will support dynamic fee functionality, fee subsidization, and account abstraction."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        267,
                        526,
                        312
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                267,
                                526,
                                312
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        267,
                                        526,
                                        312
                                    ],
                                    "type": "text",
                                    "content": "Sonic is unique as the chain is built by the same team behind Fantom Opera, a chain that proved its resilience with over "
                                },
                                {
                                    "bbox": [
                                        67,
                                        267,
                                        526,
                                        312
                                    ],
                                    "type": "inline_equation",
                                    "content": "99.9\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        267,
                                        526,
                                        312
                                    ],
                                    "type": "text",
                                    "content": " uptime over four years while supporting over USD 14 billion in total value locked at its peak²."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        152,
                        354,
                        440,
                        375
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                152,
                                354,
                                440,
                                375
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        152,
                                        354,
                                        440,
                                        375
                                    ],
                                    "type": "text",
                                    "content": "Business Case & Initial Objectives"
                                }
                            ]
                        }
                    ],
                    "index": 4,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        391,
                        526,
                        466
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                391,
                                526,
                                466
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        391,
                                        526,
                                        466
                                    ],
                                    "type": "text",
                                    "content": "As a decentralized proof- of- stake layer- 1 network, we are primarily offering distributed computing power supported by fees. However, the current perverse incentive structures within the industry cause fundamentally productive app and network revenue to be sidelined in favor of short- term parasitic and extractive monetization, leading to a decline in growth and momentum."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        481,
                        526,
                        509
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                481,
                                526,
                                509
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        481,
                                        526,
                                        509
                                    ],
                                    "type": "text",
                                    "content": "As such, our measure of success is derived from a simple calculation that checks whether the network revenue is higher than the total cost to incentivize validators:"
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        70,
                        526,
                        525,
                        540
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                70,
                                526,
                                525,
                                540
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        70,
                                        526,
                                        525,
                                        540
                                    ],
                                    "type": "text",
                                    "content": "[Success = (Transactions * Cost Per Transaction) - Total Cost To Incentivize Validators]"
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        555,
                        526,
                        631
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                555,
                                526,
                                631
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        555,
                                        526,
                                        631
                                    ],
                                    "type": "text",
                                    "content": "We create demand for these transactions by supporting developers and companies in building consumer or business- to- business (B2B) applications that require writing to the network for a fee. Sonic's objective is to drive demand to utilize the maximum amount of transactions our network can effectively supply without causing disruption while charging enough per transaction to cover the emission rate of the network."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        67,
                        645,
                        526,
                        689
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                645,
                                526,
                                689
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        645,
                                        526,
                                        689
                                    ],
                                    "type": "text",
                                    "content": "Our network can comfortably finalize up to 900 million ERC- 20 transfers per day³ with sub- second TTF. This supply- side capacity far exceeds current demand. For example, all L2s combined handle around 12 million transactions per day, peaking at approximately 17 million."
                                }
                            ]
                        }
                    ],
                    "index": 9
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 6
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        97,
                        528,
                        126
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                97,
                                528,
                                126
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        528,
                                        126
                                    ],
                                    "type": "text",
                                    "content": "Solana's notable recent peak was 40 million transactions per day<sup>4</sup>. Even combining these peaks totals about 57 million transactions per day, which is a fraction of our threshold."
                                }
                            ]
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        67,
                        140,
                        528,
                        185
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                140,
                                528,
                                185
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        140,
                                        528,
                                        185
                                    ],
                                    "type": "text",
                                    "content": "With an abundance of block space and transaction capacity, our focus shifts to building out that demand. Achieving more demand on one network than the entire industry currently processes requires bold initiatives, such as:"
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        83,
                        199,
                        529,
                        353
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                83,
                                199,
                                529,
                                353
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        83,
                                        199,
                                        529,
                                        353
                                    ],
                                    "type": "text",
                                    "content": "- Fee Monetization (FeeM), rewarding builders with up to "
                                },
                                {
                                    "bbox": [
                                        83,
                                        199,
                                        529,
                                        353
                                    ],
                                    "type": "inline_equation",
                                    "content": "90\\%"
                                },
                                {
                                    "bbox": [
                                        83,
                                        199,
                                        529,
                                        353
                                    ],
                                    "type": "text",
                                    "content": " of their apps' fees- Sonic Gateway, which allows users and builders to access Ethereum's liquidity- Orchestrating one of the largest airdrop campaigns in history to bootstrap the network's flywheel effect with new users and protocols.- Dynamic fee functionality, allowing developers to customize gas costs for interacting with their contracts, facilitating a creator economy on-chain.- Innovator Fund, which allocates up to 200,000,000 S tokens from the Sonic Labs treasury to acquire infrastructure and strategic partners for Sonic's long-term growth.- Sonic & Sodas, empowering our community to host developer-focused networking events around the world funded by Sonic Labs."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        66,
                        367,
                        528,
                        396
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                367,
                                528,
                                396
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        367,
                                        528,
                                        396
                                    ],
                                    "type": "text",
                                    "content": "All of this will be done alongside deploying AAA- grade infrastructure partners for our developer base to use, including Chainlink, Pyth, Dune, Alchemy, Safe, and more."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "type": "image",
                    "bbox": [
                        140,
                        411,
                        450,
                        673
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                140,
                                411,
                                450,
                                673
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        140,
                                        411,
                                        450,
                                        673
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                140,
                                                411,
                                                450,
                                                673
                                            ],
                                            "type": "image",
                                            "image_path": "d467fa540cdb395f826642112b3268922329ca66da6b26475bed83daa527cbf5.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 4,
                            "type": "image_body"
                        }
                    ],
                    "index": 4
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 7
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        253,
                        100,
                        340,
                        118
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                253,
                                100,
                                340,
                                118
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        253,
                                        100,
                                        340,
                                        118
                                    ],
                                    "type": "text",
                                    "content": "Incentives"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        135,
                        527,
                        179
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                135,
                                527,
                                179
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        135,
                                        527,
                                        179
                                    ],
                                    "type": "text",
                                    "content": "Drawing parallels to PayPal's early days, where Peter Thiel invested heavily in user acquisition by paying users \\(\\) 10$ for signing up and referring a friend, we aim to reach our own critical mass through significant upfront growth spend."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        193,
                        528,
                        269
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                193,
                                528,
                                269
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        193,
                                        528,
                                        269
                                    ],
                                    "type": "text",
                                    "content": "The Sonic Labs treasury will fund initiatives like the Innovator Program with up to 200,000,000 S tokens to expedite the immediate adoption of apps to the Sonic chain and support new innovative ventures. Our 190,500,000 S airdrop campaign will give Sonic developers a chance to attract more users by incentivizing app usage. Additionally, we are rapidly simplifying our liquid staking token (LST) market to give more flexibility to our dedicated token holders."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        285,
                        268,
                        305
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                285,
                                268,
                                305
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        285,
                                        268,
                                        305
                                    ],
                                    "type": "text",
                                    "content": "Sonic Labs Innovator Fund"
                                }
                            ]
                        }
                    ],
                    "index": 3,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        319,
                        528,
                        380
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                319,
                                528,
                                380
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        319,
                                        528,
                                        380
                                    ],
                                    "type": "text",
                                    "content": "Funding from the Sonic Labs Innovator Fund comes directly from the Sonic Labs treasury and comprises up to 200,000,000 S tokens. It is currently being used to secure top- tier infrastructure integrations for the Sonic network, ensuring our builders have the tools and capabilities to thrive in today's challenging marketplace."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        66,
                        394,
                        526,
                        423
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                394,
                                526,
                                423
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        394,
                                        526,
                                        423
                                    ],
                                    "type": "text",
                                    "content": "We are actively engaging with dozens of applications across the industry and top- tier infrastructure providers in areas like:"
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        84,
                        437,
                        242,
                        622
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                437,
                                242,
                                622
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        437,
                                        242,
                                        622
                                    ],
                                    "type": "text",
                                    "content": "On- chain tooling Compliance Native assets Real- world assets Bridge integration Custodial solutions Institutional adoption Exchange- traded products Wallets Subgraphs Strategic Web2 partnerships And many more"
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        66,
                        637,
                        528,
                        665
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                637,
                                528,
                                665
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        637,
                                        528,
                                        665
                                    ],
                                    "type": "text",
                                    "content": "Publicly secured infrastructure integrations so far include Chainlink, Dune, Safe, Pyth, Alchemy, Redstone, Tenderly, and more."
                                }
                            ]
                        }
                    ],
                    "index": 7
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 8
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        68,
                        99,
                        192,
                        116
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                68,
                                99,
                                192,
                                116
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        68,
                                        99,
                                        192,
                                        116
                                    ],
                                    "type": "text",
                                    "content": "Airdrop Program"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        132,
                        528,
                        161
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                132,
                                528,
                                161
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        132,
                                        528,
                                        161
                                    ],
                                    "type": "text",
                                    "content": "We're planning an airdrop of 190,500,000 S tokens to incentivize user and developer activity on both Opera and the new Sonic chain."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        174,
                        528,
                        235
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                174,
                                528,
                                235
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        174,
                                        528,
                                        235
                                    ],
                                    "type": "text",
                                    "content": "The first major component of our airdrop is our Sonic Boom program, which offers up to 30 winning projects an allocation of Sonic Gems - points for our airdrop - as bounties for developing innovative apps across various categories, which can help bootstrap the DeFi ecosystem on Sonic and kickstart the flywheel of adoption."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        248,
                        528,
                        326
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                248,
                                528,
                                326
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        248,
                                        528,
                                        326
                                    ],
                                    "type": "text",
                                    "content": "Projects can distribute these Gems to users as rewards for using their apps, helping them sustain user activity by incentivizing usage. We're aiming to discover promising teams and give them the tools they need to create successful applications in DeFi, gaming, AI, and more. Our airdrop focus is on empowering our developer base to hit their own critical mass so that we can continue to support their growth as they expand their businesses."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "type": "image",
                    "bbox": [
                        67,
                        345,
                        525,
                        599
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                67,
                                345,
                                525,
                                599
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        67,
                                        345,
                                        525,
                                        599
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                67,
                                                345,
                                                525,
                                                599
                                            ],
                                            "type": "image",
                                            "image_path": "09a29a4a695233b140e379deb28a0a97bd9cdfee537b431f9df45edb39e35cac.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 4,
                            "type": "image_body"
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        640,
                        166,
                        657
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                640,
                                166,
                                657
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        640,
                                        166,
                                        657
                                    ],
                                    "type": "text",
                                    "content": "Airdrop Design"
                                }
                            ]
                        }
                    ],
                    "index": 5,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        672,
                        528,
                        733
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                672,
                                528,
                                733
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        672,
                                        528,
                                        733
                                    ],
                                    "type": "text",
                                    "content": "We've designed a deflationary airdrop system, featuring a unique linear decay mechanism that introduces game theory to address the challenging nature of airdrop incentives on an active chain. Specifically, this airdrop requires a strategic design to minimize abrupt dislocation of circulating supply in short periods, which we believe a linear decay and burn solves."
                                }
                            ]
                        }
                    ],
                    "index": 6
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 9
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        97,
                        528,
                        174
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                97,
                                528,
                                174
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        528,
                                        174
                                    ],
                                    "type": "text",
                                    "content": "The airdrop model utilizes a unique burn factor that encourages recipients to increase activity on- chain while awaiting their preferred exit burn. Recipients can either wait for the full maturation of their airdropped position or claim early with a burn penalty. For those who choose neither option, there will be a marketplace to trade their S airdrop allocation to speculative buyers."
                                }
                            ]
                        }
                    ],
                    "index": 0
                },
                {
                    "type": "image",
                    "bbox": [
                        98,
                        190,
                        497,
                        375
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                98,
                                190,
                                497,
                                375
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        98,
                                        190,
                                        497,
                                        375
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                98,
                                                190,
                                                497,
                                                375
                                            ],
                                            "type": "image",
                                            "image_path": "24307f408d2d01d582ae6fba0f242b719d5eae32b2cdae3437f094b34614faee.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 1,
                            "type": "image_body"
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        409,
                        528,
                        470
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                409,
                                528,
                                470
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "text",
                                    "content": "On the first day of the airdrop, "
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "inline_equation",
                                    "content": "25\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "text",
                                    "content": " of a user's S token airdrop allocation will be liquid, while the remaining "
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "inline_equation",
                                    "content": "75\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "text",
                                    "content": " will be vested over 9 months (270 days) as ERC- 1155 NFT positions. Sonic users can claim this "
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "inline_equation",
                                    "content": "25\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        409,
                                        528,
                                        470
                                    ],
                                    "type": "text",
                                    "content": " portion immediately and have the flexibility to decide when to claim their final allocation at the respective burn rate."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        483,
                        528,
                        544
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                483,
                                528,
                                544
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        483,
                                        528,
                                        544
                                    ],
                                    "type": "text",
                                    "content": "Users who choose to hold their NFT but wish to trade it on a secondary marketplace are free to do so, creating a speculative market on individual user airdrop allocations while also creating deflationary pressures on the airdrop. The chart below illustrates the amount of S tokens users would forfeit to the burn mechanism if they claim before the full 270- day maturation period."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "type": "image",
                    "bbox": [
                        111,
                        555,
                        482,
                        773
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                111,
                                555,
                                482,
                                773
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        111,
                                        555,
                                        482,
                                        773
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                111,
                                                555,
                                                482,
                                                773
                                            ],
                                            "type": "image",
                                            "image_path": "9b853a2dd8733ba21a55148d53bad12d48ae0c3d5a4693961a87c8f69a937217.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 4,
                            "type": "image_body"
                        }
                    ],
                    "index": 4
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 10
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        99,
                        196,
                        116
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                99,
                                196,
                                116
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        99,
                                        196,
                                        116
                                    ],
                                    "type": "text",
                                    "content": "Fee Monetization"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        132,
                        527,
                        176
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                132,
                                527,
                                176
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        132,
                                        527,
                                        176
                                    ],
                                    "type": "text",
                                    "content": "Fee Monetization Fee Monetization (FeeM) on Sonic lets builders earn "
                                },
                                {
                                    "bbox": [
                                        67,
                                        132,
                                        527,
                                        176
                                    ],
                                    "type": "inline_equation",
                                    "content": "90\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        132,
                                        527,
                                        176
                                    ],
                                    "type": "text",
                                    "content": " of the network fees their apps generate, creating a sustainable revenue stream without relying on fundraising. Inspired by Web2 models like YouTube, FeeM rewards developers for the traffic they drive."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        190,
                        527,
                        250
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                190,
                                527,
                                250
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        190,
                                        527,
                                        250
                                    ],
                                    "type": "text",
                                    "content": "FeeM also challenges the extractive \"app chain\" model by allowing builders to earn "
                                },
                                {
                                    "bbox": [
                                        67,
                                        190,
                                        527,
                                        250
                                    ],
                                    "type": "inline_equation",
                                    "content": "90\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        190,
                                        527,
                                        250
                                    ],
                                    "type": "text",
                                    "content": " of their app's network fees without the need to launch a separate chain. This approach removes the high costs, infrastructure overhead, and interoperability challenges typically associated with app chains."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        264,
                        528,
                        294
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                264,
                                528,
                                294
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        264,
                                        528,
                                        294
                                    ],
                                    "type": "text",
                                    "content": "By integrating monetization directly into the network layer, FeeM simplifies revenue capture and supports scalable, efficient app development within a unified, developer- friendly ecosystem."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        67,
                        308,
                        328,
                        327
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                308,
                                328,
                                327
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        308,
                                        328,
                                        327
                                    ],
                                    "type": "text",
                                    "content": "Sonic Liquid Staking Tokens (LSTs)"
                                }
                            ]
                        }
                    ],
                    "index": 4,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        341,
                        527,
                        419
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                341,
                                527,
                                419
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        341,
                                        527,
                                        419
                                    ],
                                    "type": "text",
                                    "content": "Sonic Liquid Staking Tokens (LSTs)Sonic's new staking mechanism will introduce a fixed 14- day lock- up period and a 7- day withdrawal window. This creates a predictable and efficient framework for building a robust liquid staking token (LST) market, enabling stakers to remain capital- efficient while still supporting network security. LSTs will unlock new DeFi use cases on Sonic, from collateralized lending to yield strategies and beyond."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        248,
                        460,
                        345,
                        481
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                248,
                                460,
                                345,
                                481
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        248,
                                        460,
                                        345,
                                        481
                                    ],
                                    "type": "text",
                                    "content": "Technology"
                                }
                            ]
                        }
                    ],
                    "index": 6,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        497,
                        527,
                        557
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                497,
                                527,
                                557
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        497,
                                        527,
                                        557
                                    ],
                                    "type": "text",
                                    "content": "The Sonic chain provides developers with exceptional scalability and storage capabilities while delivering a fast and seamless user experience. Sonic achieves up to 400,000 transactions per second with sub- second finality for immediate, irreversible transactions and utilizes a cutting- edge storage system for efficient data management."
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        574,
                        528,
                        604
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                574,
                                528,
                                604
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        574,
                                        528,
                                        604
                                    ],
                                    "type": "text",
                                    "content": "Unlike L2s and Ethereum, true finality is achieved in only one block (no longest- chain rule) and does not require packaging the data and writing back to Ethereum."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        67,
                        622,
                        528,
                        698
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                622,
                                528,
                                698
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        622,
                                        528,
                                        698
                                    ],
                                    "type": "text",
                                    "content": "The Sonic blockchain utilizes a proof- of- stake consensus mechanism designed to minimize environmental impact relative to proof- of- work systems. Sonic aims to maintain a low carbon footprint by promoting efficient validation and network operation. A detailed assessment of Sonic's energy consumption and environmental impact is published on soniclabs.com/environment as part of our ongoing transparency commitments."
                                }
                            ]
                        }
                    ],
                    "index": 9
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 11
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        99,
                        181,
                        116
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                99,
                                181,
                                116
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        99,
                                        181,
                                        116
                                    ],
                                    "type": "text",
                                    "content": "Sonic Gateway"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        126,
                        528,
                        202
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                126,
                                528,
                                202
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        126,
                                        528,
                                        202
                                    ],
                                    "type": "text",
                                    "content": "In the evolving blockchain landscape, a native, secure bridge is essential for a healthy ecosystem, enabling robust interoperability and preventing networks from being siloed. However, current layer- 1 and layer- 2 solutions often force users to compromise on security and speed, relying on systems that expose funds to significant risks - over \\(\\) 2.5$ billion has been lost already due to bridge hacks."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        66,
                        219,
                        453,
                        234
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                219,
                                453,
                                234
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        219,
                                        453,
                                        234
                                    ],
                                    "type": "text",
                                    "content": "Recognizing these systemic threats, we had simple goals in mind for our bridge:"
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        84,
                        250,
                        422,
                        280
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                250,
                                422,
                                280
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        250,
                                        422,
                                        280
                                    ],
                                    "type": "text",
                                    "content": "Security: Ensure safety with a built- in fail- safe mechanism.- Speed: Provide a smooth user experience for easy asset bridging."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        67,
                        298,
                        528,
                        343
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                298,
                                528,
                                343
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        298,
                                        528,
                                        343
                                    ],
                                    "type": "text",
                                    "content": "The Sonic Gateway is our secure bridge that facilitates ERC- 20 token transfers between Ethereum and Sonic With a built- in fail- safe mechanism, the Sonic Gateway provides asset security, safeguarding your funds under all circumstances."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        356,
                        528,
                        417
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                356,
                                528,
                                417
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        356,
                                        528,
                                        417
                                    ],
                                    "type": "text",
                                    "content": "The Sonic Gateway is designed for efficiency. Transfers from Ethereum to Sonic only take up to 10 minutes, while transfers from Sonic to Ethereum take up to 1 hour (these intervals are referred to as \"heartbeats\"). Although Sonic is not a layer 2, we will still be active participants in the Ethereum ecosystem as we spend ETH to write to the chain with the Sonic Gateway."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        432,
                        204,
                        446
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                432,
                                204,
                                446
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        432,
                                        204,
                                        446
                                    ],
                                    "type": "text",
                                    "content": "Fast-Lane Transaction"
                                }
                            ]
                        }
                    ],
                    "index": 6,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        462,
                        528,
                        507
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                462,
                                528,
                                507
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        462,
                                        528,
                                        507
                                    ],
                                    "type": "text",
                                    "content": "Users have the option to execute transactions immediately using a \"Fast- Lane TX.\" By paying for a transaction that bypasses the standard heartbeat - which typically delays fund availability on the target chain - they can access their funds instantly."
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        521,
                        528,
                        581
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                521,
                                528,
                                581
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        521,
                                        528,
                                        581
                                    ],
                                    "type": "text",
                                    "content": "The Fast- Lane Transaction transfers the entire state to the target chain just like a regular heartbeat transaction, benefiting all users - not just the one who submitted it. Essentially, it is equivalent to a heartbeat transaction but submitted earlier. Importantly, the Fast- Lane Transaction is added as an enhancement and does not alter the standard heartbeat timing."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        67,
                        595,
                        528,
                        656
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                595,
                                528,
                                656
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        595,
                                        528,
                                        656
                                    ],
                                    "type": "text",
                                    "content": "For example, if the standard heartbeat interval from Ethereum to Sonic is 10 minutes, submitting a Fast- Lane Transaction 5 minutes before the next scheduled heartbeat allows all users bridging from Ethereum to Sonic to access their funds immediately, while the next standard heartbeat remains 5 minutes away."
                                }
                            ]
                        }
                    ],
                    "index": 9
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 12
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        68,
                        98,
                        254,
                        114
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                68,
                                98,
                                254,
                                114
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        68,
                                        98,
                                        254,
                                        114
                                    ],
                                    "type": "text",
                                    "content": "Gateway Fail-Safe Mechanism"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        129,
                        527,
                        174
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                129,
                                527,
                                174
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        129,
                                        527,
                                        174
                                    ],
                                    "type": "text",
                                    "content": "The Sonic Gateway has a built- in fail- safe mechanism with which users can retrieve their bridged assets on the original chain in the unlikely case that Sonic or its gateway experiences a failure."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        187,
                        527,
                        248
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                187,
                                527,
                                248
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        187,
                                        527,
                                        248
                                    ],
                                    "type": "text",
                                    "content": "This fail- safe mechanism activates after 14 consecutive days of failed gateway operations, serving as a safeguard for users transferring assets from Ethereum to Sonic. Designed as a form of insurance, the 14- day fail- safe period is immutable, meaning it cannot be altered by Sonic Labs or any other third- party entity once the Sonic Gateway is deployed."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        262,
                        527,
                        291
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                262,
                                527,
                                291
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        262,
                                        527,
                                        291
                                    ],
                                    "type": "text",
                                    "content": "Importantly, this period is not intended as a contest period but rather as an essential feature that ensures users retain custody of their bridged funds on the originating chain."
                                }
                            ]
                        }
                    ],
                    "index": 3
                },
                {
                    "bbox": [
                        67,
                        305,
                        220,
                        321
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                305,
                                220,
                                321
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        305,
                                        220,
                                        321
                                    ],
                                    "type": "text",
                                    "content": "How the Fail- Safe Works"
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        336,
                        527,
                        381
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                336,
                                527,
                                381
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        336,
                                        527,
                                        381
                                    ],
                                    "type": "text",
                                    "content": "How the Fail- Safe WorksThe Sonic Gateway transmits heartbeats between the chains, which include each blockchain's Merkle root and block height. If the heartbeat ceases for 14 days, it signals that the Gateway has failed, allowing users' funds to be unlocked on Ethereum."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "type": "image",
                    "bbox": [
                        68,
                        402,
                        526,
                        502
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                68,
                                402,
                                526,
                                502
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        68,
                                        402,
                                        526,
                                        502
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                68,
                                                402,
                                                526,
                                                502
                                            ],
                                            "type": "image",
                                            "image_path": "4cb8a4f42297921cb510f57e7ec7656a4dd5342d991826b02ab7ddf142b98248.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 6,
                            "type": "image_body"
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        67,
                        513,
                        528,
                        543
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                513,
                                528,
                                543
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        513,
                                        528,
                                        543
                                    ],
                                    "type": "text",
                                    "content": "Only assets routed through the Sonic Gateway can be recovered. The 14- day duration serves as a buffer period to address any issues with the Gateway before it is deemed unusable."
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        561,
                        203,
                        580
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                561,
                                203,
                                580
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        561,
                                        203,
                                        580
                                    ],
                                    "type": "text",
                                    "content": "Sonic vs. Layer 2s"
                                }
                            ]
                        }
                    ],
                    "index": 8,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        587,
                        527,
                        647
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                587,
                                527,
                                647
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        587,
                                        527,
                                        647
                                    ],
                                    "type": "text",
                                    "content": "Most layer- 2 platforms are optimistic rollups that operate on the assumption that all withdrawals are valid unless contested (hence the name \"optimistic\"). To ensure security, a 7- day challenge period exists, allowing anyone to verify and dispute withdrawal claims made on Ethereum."
                                }
                            ]
                        }
                    ],
                    "index": 9
                },
                {
                    "bbox": [
                        67,
                        661,
                        527,
                        722
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                661,
                                527,
                                722
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        661,
                                        527,
                                        722
                                    ],
                                    "type": "text",
                                    "content": "For example, if you wish to withdraw 2 ETH from Optimism to any other platform, the assets will not actually be released on Ethereum until the 7- day challenge period has passed. So why does a transfer from platforms like Arbitrum and Optimism to an exchange like Binance only take a few minutes?"
                                }
                            ]
                        }
                    ],
                    "index": 10
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 13
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        97,
                        527,
                        174
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                97,
                                527,
                                174
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        527,
                                        174
                                    ],
                                    "type": "text",
                                    "content": "When depositing from an optimistic rollup to an exchange like Binance, the transfer may appear quick, but the exchange is assuming the risk associated with the challenge period; this is because Binance trusts most layer- 2 platforms. However, the funds credited to your account by the exchange are not technically secure until the 7- day challenge window closes, meaning the exchange bears the risk during this period."
                                }
                            ]
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        67,
                        187,
                        527,
                        248
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                187,
                                527,
                                248
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        187,
                                        527,
                                        248
                                    ],
                                    "type": "text",
                                    "content": "In contrast, Sonic, as a layer- 1 platform with its own secure validators, offers instant (1- block) transfers to exchanges without the associated risk, as these transactions are not subject to any challenge period, which includes USDC (and other ERC- 20 tokens) if it becomes native on Sonic."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        261,
                        527,
                        306
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                261,
                                527,
                                306
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        261,
                                        527,
                                        306
                                    ],
                                    "type": "text",
                                    "content": "Additionally, assets bridged from Ethereum through the Sonic Gateway finalize within an hour, offering a much faster and safer alternative compared to the 7- day challenge period required by most layer- 2 solutions."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        322,
                        185,
                        340
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                322,
                                185,
                                340
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        322,
                                        185,
                                        340
                                    ],
                                    "type": "text",
                                    "content": "Sonic Database"
                                }
                            ]
                        }
                    ],
                    "index": 3,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        350,
                        527,
                        411
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                350,
                                527,
                                411
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        350,
                                        527,
                                        411
                                    ],
                                    "type": "text",
                                    "content": "Sonic uses database storage to store its world state, which includes account information, virtual machine bytecode, smart contract storage, etc. This database has a feature called live pruning, which removes historical data automatically, reducing storage needs for validators as the blockchain grows."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        428,
                        527,
                        474
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                428,
                                527,
                                474
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        428,
                                        527,
                                        474
                                    ],
                                    "type": "text",
                                    "content": "Previously, pruning required validator nodes to go offline, risking financial and operational issues for them. Now, validators can use live pruning without going offline, ensuring continuous operation and saving on disk space and costs by discarding historical data in real- time."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        491,
                        527,
                        551
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                491,
                                527,
                                551
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        491,
                                        527,
                                        551
                                    ],
                                    "type": "text",
                                    "content": "Live pruning works by splitting the database into two types: LiveDB and ArchiveDB. The LiveDB contains the world state of the current block only, whereas the ArchiveDB contains the world states of all historical blocks. Validators use only LiveDB, while archive nodes have both LiveDB and ArchiveDB to handle historical data requests through the RPC interface."
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        67,
                        570,
                        527,
                        614
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                570,
                                527,
                                614
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        570,
                                        527,
                                        614
                                    ],
                                    "type": "text",
                                    "content": "Sonic's database storage uses efficient tree- like or hierarchical structures, which simplifies data retrieval. Importantly, it still provides cryptographic signatures for a world state and archive capabilities using an incremental version of a prefix algorithm."
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        631,
                        527,
                        661
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                631,
                                527,
                                661
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        631,
                                        527,
                                        661
                                    ],
                                    "type": "text",
                                    "content": "Additionally, it utilizes a native disk format instead of storing the world state indirectly through key- value stores like LevelDB or PebbleDB."
                                }
                            ]
                        }
                    ],
                    "index": 8
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 14
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        68,
                        98,
                        232,
                        116
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                68,
                                98,
                                232,
                                116
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        68,
                                        98,
                                        232,
                                        116
                                    ],
                                    "type": "text",
                                    "content": "Sonic Virtual Machine"
                                }
                            ]
                        }
                    ],
                    "index": 0,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        126,
                        527,
                        186
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                126,
                                527,
                                186
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        126,
                                        527,
                                        186
                                    ],
                                    "type": "text",
                                    "content": "Sonic's virtual machine (VM) replaces the EVM and increases the speed of execution on Sonic. For our developer community, there is no need to worry - the VM is fully Solidity and Vyper compatible, allowing you to continue using the same development tools. Additionally, Sonic supports Geth 1.4."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        203,
                        527,
                        264
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                203,
                                527,
                                264
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        203,
                                        527,
                                        264
                                    ],
                                    "type": "text",
                                    "content": "The VM uses dynamic translation, where the code is translated into a more efficient instruction format inside the client, allowing for more efficient execution of the smart contract. This is achieved through more efficient implementation techniques and \"super- instructions,\" which are efficient representations of frequently occurring patterns in code."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        246,
                        280,
                        348,
                        299
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                246,
                                280,
                                348,
                                299
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        246,
                                        280,
                                        348,
                                        299
                                    ],
                                    "type": "text",
                                    "content": "Tokenomics"
                                }
                            ]
                        }
                    ],
                    "index": 3,
                    "level": 1
                },
                {
                    "bbox": [
                        66,
                        316,
                        452,
                        329
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                316,
                                452,
                                329
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        316,
                                        452,
                                        329
                                    ],
                                    "type": "text",
                                    "content": "The S token is the native token of Sonic. It has multiple roles within the network:"
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        84,
                        347,
                        391,
                        407
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                347,
                                391,
                                407
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        347,
                                        391,
                                        407
                                    ],
                                    "type": "text",
                                    "content": "- Paying for transaction fees- Staking to participate in securing the chain (minimum 1 S)- Running a validator to secure the chain (minimum 50,000 S)- Participating in governance"
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        424,
                        527,
                        470
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                424,
                                527,
                                470
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        424,
                                        527,
                                        470
                                    ],
                                    "type": "text",
                                    "content": "At Sonic's launch, the total supply equaled 3.175 billion S. As decided by multiple governance proposals, the additions outlined further below will gradually be implemented into the tokenomics of the S token."
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        68,
                        487,
                        192,
                        506
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                68,
                                487,
                                192,
                                506
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        68,
                                        487,
                                        192,
                                        506
                                    ],
                                    "type": "text",
                                    "content": "Airdrop Program"
                                }
                            ]
                        }
                    ],
                    "index": 7,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        522,
                        528,
                        582
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                522,
                                528,
                                582
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        522,
                                        528,
                                        582
                                    ],
                                    "type": "text",
                                    "content": "An additional "
                                },
                                {
                                    "bbox": [
                                        67,
                                        522,
                                        528,
                                        582
                                    ],
                                    "type": "inline_equation",
                                    "content": "6\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        522,
                                        528,
                                        582
                                    ],
                                    "type": "text",
                                    "content": " of the 3.175 billion S will be minted six months after Sonic launches exclusively used for the airdrop program, rewarding both Fantom Opera and Sonic users and builders. The airdrop features an innovative burn mechanism that rewards active participation and gradually reduces the total supply of S tokens."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        68,
                        599,
                        196,
                        618
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                68,
                                599,
                                196,
                                618
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        68,
                                        599,
                                        196,
                                        618
                                    ],
                                    "type": "text",
                                    "content": "Ongoing Funding"
                                }
                            ]
                        }
                    ],
                    "index": 9,
                    "level": 1
                },
                {
                    "bbox": [
                        66,
                        627,
                        438,
                        640
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                627,
                                438,
                                640
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        627,
                                        438,
                                        640
                                    ],
                                    "type": "text",
                                    "content": "Six months after Sonic launches, the network will mint additional S tokens to:"
                                }
                            ]
                        }
                    ],
                    "index": 10
                },
                {
                    "bbox": [
                        84,
                        658,
                        518,
                        719
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                658,
                                518,
                                719
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        658,
                                        518,
                                        719
                                    ],
                                    "type": "text",
                                    "content": "Increase S adoption and global presence Grow the team and scale operations to drive increased adoption Implement robust marketing initiatives and DeFi onboarding campaigns Launch the Sonic Spark and Sonic University programs to advance the future of Sonic"
                                }
                            ]
                        }
                    ],
                    "index": 11
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 15
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        97,
                        526,
                        142
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                97,
                                526,
                                142
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        526,
                                        142
                                    ],
                                    "type": "text",
                                    "content": "To fund this program, an additional "
                                },
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        526,
                                        142
                                    ],
                                    "type": "inline_equation",
                                    "content": "1.5\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        526,
                                        142
                                    ],
                                    "type": "text",
                                    "content": " of the initial total supply of S will be minted annually (corresponding to 47,625,000 tokens) for six years, starting six months after the mainnet launch."
                                }
                            ]
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        67,
                        159,
                        526,
                        205
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                159,
                                526,
                                205
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        159,
                                        526,
                                        205
                                    ],
                                    "type": "text",
                                    "content": "However, to guard against inflation, the network will burn newly minted tokens not used during the year, ensuring that "
                                },
                                {
                                    "bbox": [
                                        67,
                                        159,
                                        526,
                                        205
                                    ],
                                    "type": "inline_equation",
                                    "content": "100\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        159,
                                        526,
                                        205
                                    ],
                                    "type": "text",
                                    "content": " of all newly minted tokens from this initiative are allocated toward network growth rather than being held by the treasury for later use."
                                }
                            ]
                        }
                    ],
                    "index": 1
                },
                {
                    "bbox": [
                        67,
                        222,
                        526,
                        251
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                222,
                                526,
                                251
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        222,
                                        526,
                                        251
                                    ],
                                    "type": "text",
                                    "content": "For example, if Sonic Labs uses only 5,000,000 tokens in the first year, the Sonic Foundation will burn the remaining 42,625,000 tokens."
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        67,
                        268,
                        181,
                        285
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                268,
                                181,
                                285
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        268,
                                        181,
                                        285
                                    ],
                                    "type": "text",
                                    "content": "Block Rewards"
                                }
                            ]
                        }
                    ],
                    "index": 3,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        301,
                        527,
                        378
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                301,
                                527,
                                378
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        301,
                                        527,
                                        378
                                    ],
                                    "type": "text",
                                    "content": "We are migrating validator rewards from Fantom Opera to Sonic. Initially, Opera validators were scheduled to receive rewards for several more years. However, as validators and stakers transition to Sonic, we will reduce their block rewards. The funds saved from this reduction will be reallocated to reward Sonic validators. Meanwhile, the Sonic Foundation will continue to maintain Opera validators for the foreseeable future."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        67,
                        391,
                        526,
                        452
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                391,
                                526,
                                452
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        391,
                                        526,
                                        452
                                    ],
                                    "type": "text",
                                    "content": "Sonic aims for a target annual percentage yield (APR) of "
                                },
                                {
                                    "bbox": [
                                        67,
                                        391,
                                        526,
                                        452
                                    ],
                                    "type": "inline_equation",
                                    "content": "3.5\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        391,
                                        526,
                                        452
                                    ],
                                    "type": "text",
                                    "content": ". To sustain this rate without causing inflation during the first four years, we are reallocating the remaining FTM block rewards from Opera to Sonic for validator and staker rewards. These rewards are already included in the initial supply of 3.175 billion S tokens."
                                }
                            ]
                        }
                    ],
                    "index": 5
                },
                {
                    "bbox": [
                        67,
                        465,
                        527,
                        495
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                465,
                                527,
                                495
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        465,
                                        527,
                                        495
                                    ],
                                    "type": "text",
                                    "content": "While the initial total supply of S is technically 3.175 billion to correspond with FTM's total supply, the circulating supply will be approximately 2,883,358,939 tokens at launch."
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        67,
                        508,
                        527,
                        554
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                508,
                                527,
                                554
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        508,
                                        527,
                                        554
                                    ],
                                    "type": "text",
                                    "content": "The difference — amounting to 70,067,224 tokens annually — will be distributed as rewards to validators over the first four years of Sonic. This approach allows us to avoid minting new S tokens for block rewards during this period."
                                }
                            ]
                        }
                    ],
                    "index": 7
                },
                {
                    "bbox": [
                        67,
                        567,
                        527,
                        644
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                567,
                                527,
                                644
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        567,
                                        527,
                                        644
                                    ],
                                    "type": "text",
                                    "content": "As a result of these changes, Opera's APR will drop to zero upon Sonic's launch. Additionally, to preserve value for all FTM and S token holders and eliminate the need for new inflationary rewards at Sonic's inception, we will not mint new tokens for validator security for the initial four years of Sonic's deployment. After these four years, S block rewards will continue by minting new tokens at a rate of "
                                },
                                {
                                    "bbox": [
                                        67,
                                        567,
                                        527,
                                        644
                                    ],
                                    "type": "inline_equation",
                                    "content": "1.75\\%"
                                },
                                {
                                    "bbox": [
                                        67,
                                        567,
                                        527,
                                        644
                                    ],
                                    "type": "text",
                                    "content": " per year to reward validators."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        67,
                        656,
                        475,
                        671
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                656,
                                475,
                                671
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        656,
                                        475,
                                        671
                                    ],
                                    "type": "text",
                                    "content": "The chart below illustrates the complete emission of the S token over its first 7 years."
                                }
                            ]
                        }
                    ],
                    "index": 9
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 16
        },
        {
            "para_blocks": [
                {
                    "type": "image",
                    "bbox": [
                        138,
                        105,
                        454,
                        318
                    ],
                    "blocks": [
                        {
                            "bbox": [
                                138,
                                105,
                                454,
                                318
                            ],
                            "lines": [
                                {
                                    "bbox": [
                                        138,
                                        105,
                                        454,
                                        318
                                    ],
                                    "spans": [
                                        {
                                            "bbox": [
                                                138,
                                                105,
                                                454,
                                                318
                                            ],
                                            "type": "image",
                                            "image_path": "0ceb0eaa3aa9cd948c94178e0f76ea8e11452646ad51718a5033ee948d5207dc.jpg"
                                        }
                                    ]
                                }
                            ],
                            "index": 0,
                            "type": "image_body"
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        67,
                        331,
                        153,
                        349
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                331,
                                153,
                                349
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        331,
                                        153,
                                        349
                                    ],
                                    "type": "text",
                                    "content": "Token Burn"
                                }
                            ]
                        }
                    ],
                    "index": 1,
                    "level": 1
                },
                {
                    "bbox": [
                        66,
                        365,
                        494,
                        379
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                365,
                                494,
                                379
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        365,
                                        494,
                                        379
                                    ],
                                    "type": "text",
                                    "content": "We have two burn mechanisms in place that will decrease the emission of new S tokens:"
                                }
                            ]
                        }
                    ],
                    "index": 2
                },
                {
                    "bbox": [
                        84,
                        397,
                        170,
                        411
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                397,
                                170,
                                411
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        397,
                                        170,
                                        411
                                    ],
                                    "type": "text",
                                    "content": "Airdrop Burn"
                                }
                            ]
                        }
                    ],
                    "index": 3,
                    "level": 1
                },
                {
                    "bbox": [
                        119,
                        412,
                        519,
                        441
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                119,
                                412,
                                519,
                                441
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        119,
                                        412,
                                        519,
                                        441
                                    ],
                                    "type": "text",
                                    "content": "- Users who choose not to wait for the full 270-day maturation period for "
                                },
                                {
                                    "bbox": [
                                        119,
                                        412,
                                        519,
                                        441
                                    ],
                                    "type": "inline_equation",
                                    "content": "75\\%"
                                },
                                {
                                    "bbox": [
                                        119,
                                        412,
                                        519,
                                        441
                                    ],
                                    "type": "text",
                                    "content": " of their airdrop will lose a portion of their S tokens, which will be burned."
                                }
                            ]
                        }
                    ],
                    "index": 4
                },
                {
                    "bbox": [
                        84,
                        460,
                        220,
                        473
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                84,
                                460,
                                220,
                                473
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        84,
                                        460,
                                        220,
                                        473
                                    ],
                                    "type": "text",
                                    "content": "Ongoing Funding Burn"
                                }
                            ]
                        }
                    ],
                    "index": 5,
                    "level": 1
                },
                {
                    "bbox": [
                        119,
                        475,
                        515,
                        504
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                119,
                                475,
                                515,
                                504
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        119,
                                        475,
                                        515,
                                        504
                                    ],
                                    "type": "text",
                                    "content": "- From the 47,625,000 S tokens minted annually in the first six years of Sonic to fund growth, the network will burn any of the tokens not used during the year."
                                }
                            ]
                        }
                    ],
                    "index": 6
                },
                {
                    "bbox": [
                        249,
                        567,
                        345,
                        588
                    ],
                    "type": "title",
                    "lines": [
                        {
                            "bbox": [
                                249,
                                567,
                                345,
                                588
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        249,
                                        567,
                                        345,
                                        588
                                    ],
                                    "type": "text",
                                    "content": "Conclusion"
                                }
                            ]
                        }
                    ],
                    "index": 7,
                    "level": 1
                },
                {
                    "bbox": [
                        67,
                        603,
                        527,
                        664
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                603,
                                527,
                                664
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        603,
                                        527,
                                        664
                                    ],
                                    "type": "text",
                                    "content": "Sonic aims to revolutionize the blockchain industry by providing a next- generation layer- 1 platform that combines speed, scalability, and security. By introducing innovative features like Fee Monetization, a secure Gateway to Ethereum, and simplified staking mechanisms, Sonic positions itself as a developer- friendly platform that prioritizes builders and users alike."
                                }
                            ]
                        }
                    ],
                    "index": 8
                },
                {
                    "bbox": [
                        67,
                        677,
                        527,
                        739
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                677,
                                527,
                                739
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        677,
                                        527,
                                        739
                                    ],
                                    "type": "text",
                                    "content": "Our commitment to fostering a robust developer ecosystem, coupled with strategic partnerships, sets the stage for unprecedented growth. With the capacity to handle up to 900 million ERC- 20 transactions per day and offering sub- second confirmation times, Sonic is poised to meet and exceed current industry demands and standards."
                                }
                            ]
                        }
                    ],
                    "index": 9
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 17
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        67,
                        97,
                        528,
                        174
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                97,
                                528,
                                174
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        97,
                                        528,
                                        174
                                    ],
                                    "type": "text",
                                    "content": "By focusing on enabling **productive economic activity** through access to high- performance distributed computing power and **redefining network incentive structures**, Sonic seeks to drive mass adoption and usher in a new era where blockchain technology becomes seamlessly integrated into everyday applications. We invite developers, businesses, and users to join us on this exciting journey toward a more efficient, inclusive, and truly decentralized future."
                                }
                            ]
                        }
                    ],
                    "index": 0
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 18
        },
        {
            "para_blocks": [
                {
                    "bbox": [
                        66,
                        145,
                        348,
                        320
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                66,
                                145,
                                348,
                                320
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        66,
                                        145,
                                        348,
                                        320
                                    ],
                                    "type": "text",
                                    "content": "获得资金 外部的 文件空投 博客 白皮书创新者基金 文档 环境费用货币化 媒体工具包 加斯利交易按 服务条款隐私政策"
                                }
                            ]
                        }
                    ],
                    "index": 0
                },
                {
                    "bbox": [
                        67,
                        381,
                        229,
                        395
                    ],
                    "type": "text",
                    "lines": [
                        {
                            "bbox": [
                                67,
                                381,
                                229,
                                395
                            ],
                            "spans": [
                                {
                                    "bbox": [
                                        67,
                                        381,
                                        229,
                                        395
                                    ],
                                    "type": "inline_equation",
                                    "content": "①"
                                },
                                {
                                    "bbox": [
                                        67,
                                        381,
                                        229,
                                        395
                                    ],
                                    "type": "text",
                                    "content": " 2025 Sonic Labs. 保留所有权利。"
                                }
                            ]
                        }
                    ],
                    "index": 1
                }
            ],
            "discarded_blocks": [],
            "page_size": [
                594,
                841
            ],
            "page_idx": 19
        }
    ],
    "_backend": "vlm",
    "_version_name": "2.0.6"
}